{
  "title": "Peshmerga: The Golden Square",
  "narrative": {
    "playerRole": "The player is a squad leader in a Peshmerga special operations unit, \"Unit 70,\" from the city of Slemani.",
    "storyArc": "The narrative follows the player's unit from the shock of the ISIS blitzkrieg in 2014, through key defensive and offensive battles, to the final liberation of Mosul. The story emphasizes themes of duty, sacrifice, regional unity between Kurdistan and Iraq, and the personal cost of war.",
    "historicalFidelity": "The game is grounded in real events from 2014-2017, with key story missions based on documented battles against ISIS."
  },
  "visualStyle": {
    "artStyle": "Realistic, high-fidelity 3D visuals that highlight the textures of Kurdish cities, rugged mountains, and war-torn urban landscapes.",
    "colorPalette": "Dusty yellows and arid browns contrasted with mountain greens and the vibrant colors that remain in urban safe zones."
  },
  "locations": [
    {
      "name": "Slemani (Sulaymaniyah)",
      "description": "Home base for the player's unit. The city nestles against the mountains with bustling markets, cultural centers, and government buildings. Missions begin here and showcase daily life alongside the mobilization for war."
    },
    {
      "name": "Erbil (Hawler)",
      "description": "A modern strategic hub with the ancient Citadel dominating the skyline. Missions focus on defending the outskirts and the international airport from ISIS incursions."
    },
    {
      "name": "Duhok",
      "description": "A mountainous province ideal for ambushes and defensive actions. Missions emphasize rugged terrain, narrow passes, and long sightlines."
    },
    {
      "name": "Mosul",
      "description": "The climactic battleground with intense house-to-house fighting amid devastated neighborhoods and shattered historical sites. Civilians shelter in ruins, forcing high-stakes tactical decisions."
    },
    {
      "name": "Baghdad",
      "description": "A political hub appearing in cutscenes as Peshmerga leadership coordinates with the Iraqi central government. The look and feel reflect central Iraqi architecture and atmosphere."
    }
  ],
  "gameplayMechanics": [
    {
      "name": "Tactical Squad Command",
      "description": "Issue precise orders to a four-person squad: suppress, flank, throw grenades, breach and clear. Commands must account for morale, terrain, and civilian presence."
    },
    {
      "name": "Realistic Ballistics & Combat",
      "description": "Weapons feel weighty with authentic recoil, reloads, and limited ammunition. Scarcity encourages cautious movement and coordinated assaults over run-and-gun tactics."
    },
    {
      "name": "Dynamic Day/Night & Weather",
      "description": "Missions unfold across shifting conditions: sandstorms that blind, night raids with limited NVGs, and rains that bog down vehicles and infantry alike."
    },
    {
      "name": "Squad Morale System",
      "description": "Squad morale is visible on the HUD and reacts to casualties, successes, and player choices. High morale boosts accuracy and reload speed; low morale causes hesitations and sluggish movement."
    },
    {
      "name": "Civilian Interaction & Consequences",
      "description": "Civilians complicate every urban engagement. Protecting them wins trust, intel, and side objectives. Endangering them damages morale and can jeopardize missions."
    },
    {
      "name": "Vehicle Operations",
      "description": "Drive armored vehicles or man heavy weapons on technicals during escort, pursuit, and defensive segments."
    },
    {
      "name": "Player Progression",
      "description": "Earn XP and commendations for tactical excellence and moral choices. Unlock skill tree upgrades for weapon handling, stamina, and advanced commands; requisition new gear reflecting the unit's growth."
    }
  ],
  "missions": [
    {
      "title": "The Storm Breaks",
      "location": "Slemani",
      "description": "A narrative introduction where a routine patrol turns into a desperate defense as Mosul falls. Establish a defensive perimeter to protect refugees while identifying ISIS infiltrators and fending off probing attacks with limited gear."
    },
    {
      "title": "Shields of Erbil",
      "location": "Erbil Outskirts",
      "description": "Hold defensive positions along the Makhmur front against coordinated ISIS assaults with infantry, technicals, and SVBIEDs. Coordinate with allied units and call in scarce air support while contending with a blinding sandstorm."
    },
    {
      "title": "Eagles of Duhok",
      "location": "Sinjar Mountains",
      "description": "Navigate treacherous mountain paths to rescue Yazidi civilians trapped on Mount Sinjar. Confront elite ISIS snipers, ration dwindling supplies, and escort civilians to extraction under constant threat."
    },
    {
      "title": "The Lion's Roar",
      "location": "Mosul",
      "description": "Join the Iraqi Counter-Terrorism Service for the final push through Mosul. Clear fortified strongholds, rescue hostages, defuse IEDs, and confront high-value targets in brutal urban combat."
    }
  ],
  "factions": [
    {
      "name": "Peshmerga Forces",
      "description": "A diverse coalition of veterans, volunteers, and female fighters. Gear mixes worn M81, DCU, digital patterns, and traditional attire with modern plate carriers. Kurdish flag patches and unit insignia stand out amid dusty fatigues and iconic jamedani scarves."
    },
    {
      "name": "ISIS",
      "description": "An aggressive and unpredictable foe employing suicide bombers, IEDs, tunnels, and human shields to break defenses and sap morale."
    },
    {
      "name": "Civilians",
      "description": "Families and refugees caught between battle lines. Their presence complicates targeting and demands empathy, shaping morale and story outcomes."
    }
  ],
  "audio": {
    "soundtrack": "A hybrid score blending traditional Kurdish instruments—duduk, tembur, zurna, and daf drums—with modern cinematic orchestration for tension and emotional resonance.",
    "soundEffects": "Authentic weapon reports, urban ambience, and environmental audio: calls to prayer, market chatter, Sinjar's winds, Mosul's distant gunfire. ISIS fighters shout Arabic commands, while your squad speaks Sorani and Kurmanji with morale-dependent tones."
  }
}
